# Data Manipulation

This is essentially a short introduction to [pandas](https://pandas.pydata.org/), inspired by the [tutorial](https://pandas.pydata.org/docs/user_guide/10min.html) in the `pandas`' documentation.

For quick reference, take a look at [this cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)!


## Data Structures

`pandas` main building blocks are:
* [Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html): a one-dimensional labeled array. The labels are referred to as the **index** and are the essential difference with `numpy` array.
* [DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html): a collection of `Series` organized in a "table", with **index** and **columns**.

An important thing to remember is that **data alignment is instrinsic**: the link between data and labels (either index or columns) will not be broken unless done so explicitly by you.

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([4, 6, -1, 7, 7])
s

0    4
1    6
2   -1
3    7
4    7
dtype: int64

In [3]:
df = pd.DataFrame([(4, "a"), (6, "b"), (-1, "a"), (7, "c"), (7, "d")], columns=["col1", "col2"])
df

   col1 col2
0     4    a
1     6    b
2    -1    a
3     7    c
4     7    d

Both `Series` and `DataFrame`s have methods to quickly view parts of the data or see some global properties.

In [4]:
df.head(2)

   col1 col2
0     4    a
1     6    b

In [5]:
s.tail(1)

4    7
dtype: int64

In [6]:
df.shape, s.shape

((5, 2), (5,))

In [7]:
s.dtypes

dtype('int64')

In [8]:
df.dtypes

col1     int64
col2    object
dtype: object

## Operations

As with `numpy`, operations with data in `pandas` apply elementwise.

In [9]:
1 + s / 2

0    3.0
1    4.0
2    0.5
3    4.5
4    4.5
dtype: float64

In [10]:
s == 7

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [11]:
s > 0

0     True
1     True
2    False
3     True
4     True
dtype: bool

## Selection

The fast way to select a column in a `DataFrame` is:

In [12]:
df["col1"]  # --> outputs a Series

0    4
1    6
2   -1
3    7
4    7
Name: col1, dtype: int64

The primary access method of `Series` and `DataFrame` is the **.loc** method, which slices the data based on indexing (either index or columns). Though it may not be easy to understand at the beginning, it is the most powerful method to tell `pandas` what you want and the one less prone to errors. It is also the preferred way in terms of performance.

The syntax for a `DataFrame` is:

```
df.loc[ <filter_on_rows> , <filter_on_cols> ]
```

For a `Series` there is simply no columns, so there is only one element in `[]`.

`<filter_on_rows>` and `<filter_on_cols>` are expressions that allow you to select a subset of rows and columns, respectively. Valid inputs are:
* `:`, to mean all rows/columns.
* A single label, e.g. 5 or 'a'
* A list or array of labels ['a', 'b', 'c'].
* A slice object with labels 'a':'f'
* A boolean array.

In [13]:
# select a column
df.loc[:, "col1"]

0    4
1    6
2   -1
3    7
4    7
Name: col1, dtype: int64

In [14]:
# select row with index label = 3
s.loc[3]

7

In [15]:
# select cell (0, "col2")
df.loc[0, "col2"]

'a'

In [16]:
# select rows with index labels between 1 and 3, wth all columns
df.loc[1:3, :]

   col1 col2
1     6    b
2    -1    a
3     7    c

In [17]:
# select all values in col2 where values in col1 are negative
df.loc[
    df["col1"] < 0,  # --> select rows where this boolean array is True
    "col2"
]

2    a
Name: col2, dtype: object

We can also select data by position with the `.iloc` method, which accepts:
* integers e.g. 5,
* list or array of integers e.g. [4, 3, 0],
* slice e.g. 1:7,

In [18]:
# select the value in the first column first row
df.iloc[0, 0]

4

In [19]:
# select the last two rows
df.iloc[-2:, :]

   col1 col2
3     7    c
4     7    d

## Setting values

We may want to add values to, or changes values in, a `DataFrame`. Remember that these operations change the orginal object.

In [20]:
# add a new column
df["col3"] = [-0.2, -4.7, 12.1, 12.2, np.nan]
df

   col1 col2  col3
0     4    a  -0.2
1     6    b  -4.7
2    -1    a  12.1
3     7    c  12.2
4     7    d   NaN

In [21]:
# change all the values of a column
df["col3"] = df["col3"] / 2
df

   col1 col2  col3
0     4    a -0.10
1     6    b -2.35
2    -1    a  6.05
3     7    c  6.10
4     7    d   NaN

In [22]:
# change values into -10 in col1, only where "col2" has values = a
df.loc[df["col2"] == "a", "col1"] = -10
df

   col1 col2  col3
0   -10    a -0.10
1     6    b -2.35
2   -10    a  6.05
3     7    c  6.10
4     7    d   NaN

In [23]:
# replace the values in col1 with the values in col3, only where "col2" = b
df.loc[df["col2"] == "b", "col1"] = df.loc[df["col2"] == "b", "col3"]
df

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d   NaN

We are also able to remove rows and column. Notice that dropping a column or selecting all the others are essentially the same operation. It's up to you to decide which method best suits your situation.

In [24]:
# remove column "col1"
df.drop(columns=["col1"])

  col2  col3
0    a -0.10
1    b -2.35
2    a  6.05
3    c  6.10
4    d   NaN

## Sorting

In [25]:
# sort by "col1"
df.sort_values("col1", ascending=False)

    col1 col2  col3
3   7.00    c  6.10
4   7.00    d   NaN
1  -2.35    b -2.35
0 -10.00    a -0.10
2 -10.00    a  6.05

In [26]:
# sort by index in descending order
df.sort_index(ascending=False)

    col1 col2  col3
4   7.00    d   NaN
3   7.00    c  6.10
2 -10.00    a  6.05
1  -2.35    b -2.35
0 -10.00    a -0.10

## Aggregations

Operations can be applied elementwise, as we saw, but also row-wise or column-wise, as we see now.

In [27]:
df

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d   NaN

In [28]:
# compute the sum of all values in the series
s.sum()

23

In [29]:
# compute mean and standard deviation of "col1"
df["col1"].mean(), df["col1"].std()

(-1.6700000000000004, 8.508495754244695)

In [30]:
# output the cumulative sum of col3
df["col3"].cumsum()

0   -0.10
1   -2.45
2    3.60
3    9.70
4     NaN
Name: col3, dtype: float64

In [31]:
# compute the mean between col1 and col3
df[["col1", "col3"]].mean(axis=1)

0   -5.050
1   -2.350
2   -1.975
3    6.550
4    7.000
dtype: float64

In [32]:
# count how many rows have col2 = a
(df["col2"] == "a").sum()

2

In [33]:
# are all values in col3 positive?
(df["col3"] > 0).all()

False

## Operations (apply)

The method `.apply` allows us to use any function on a `DataFrame` or `Series`

In [34]:
# apply the exponential function to col3
df["col3"].apply(np.exp)

0      0.904837
1      0.095369
2    424.113030
3    445.857770
4           NaN
Name: col3, dtype: float64

In [35]:
# apply an arbitrary function to col2
def func(x):
    if x == "a":
        return "Hello!"
    elif x == "b":
        return "Ciao!"
    elif x == "c":
        return "Hola!"

df["col2"].apply(func)

0    Hello!
1     Ciao!
2    Hello!
3     Hola!
4      None
Name: col2, dtype: object

## Grouping

Very often we need to apply operations to groups independently and combine the results. This is what the `.groupby` method helps us to do.

A simplified version of the syntax is:

```
df.groupby(<grouping_cols>)[<aggregation_cols>].<function>()
```

where `<grouping_cols` refer to the columns whose values are used to split the `DataFrame` in groups, `<aggregation_cols>` are the columns where operations are applied and `<function>` is the actual operation.

In [36]:
df

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d   NaN

In [37]:
# sum values in "col1" based on groups made on "col2"
# grouping_cols --> col2
# aggregation_cols --> col1
# function --> sum
df.groupby("col2")["col1"].sum()

col2
a   -20.00
b    -2.35
c     7.00
d     7.00
Name: col1, dtype: float64

In [38]:
# compute max minus min of "col3" for each group in "col1"
df.groupby("col1")["col3"].apply(lambda x: x.max() - x.min())

col1
-10.00    6.15
-2.35     0.00
 7.00     0.00
Name: col3, dtype: float64

In [39]:
# count distinct values in "col3" for each group in ("col1", "col2")
# SQL: select col1, col2, count(distinct col2) group by col1, col2
df.groupby(["col1", "col2"])["col3"].nunique()

col1    col2
-10.00  a       2
-2.35   b       1
 7.00   c       1
        d       0
Name: col3, dtype: int64

## Merge

When we want to combine multiple tables together, we can either concatenate or use SQL-like joins.

In the first case we would use `concat`.

In [40]:
# concatenates two copies of the same dataframe

# as new columns
display(pd.concat([df, df], axis=1))

# as new rows
display(pd.concat([df, df], axis=0))

    col1 col2  col3   col1 col2  col3
0 -10.00    a -0.10 -10.00    a -0.10
1  -2.35    b -2.35  -2.35    b -2.35
2 -10.00    a  6.05 -10.00    a  6.05
3   7.00    c  6.10   7.00    c  6.10
4   7.00    d   NaN   7.00    d   NaN

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d   NaN
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d   NaN

In the second case, we have the `merge` method, which provides a powerful way to apply join operations similar to relational databases. The syntax (simplyfied) is the following:

```python
pd.merge(
    left,              # left dataframe
    right,             # right dataframe
    how="inner",       # can be inner, left, right, outer
    left_on=None,      # name of join column(s) in the left df
    right_on=None      # name of join column(s) in the right df
)
```

In [41]:
new_df = pd.DataFrame([("a", 0), ("b", 1), ("c", 2)], columns=["x", "y"])
new_df

   x  y
0  a  0
1  b  1
2  c  2

In [42]:
# (inner) join new_df and df on col2 == x
pd.merge(new_df, df, left_on="x", right_on="col2")

   x  y   col1 col2  col3
0  a  0 -10.00    a -0.10
1  a  0 -10.00    a  6.05
2  b  1  -2.35    b -2.35
3  c  2   7.00    c  6.10

In [43]:
# (left) merge df and new_df on col2 == x
pd.merge(df, new_df, left_on="col2", right_on="x", how="left")

    col1 col2  col3    x    y
0 -10.00    a -0.10    a  0.0
1  -2.35    b -2.35    b  1.0
2 -10.00    a  6.05    a  0.0
3   7.00    c  6.10    c  2.0
4   7.00    d   NaN  NaN  NaN

## I/O

`pandas` can read from and write to several useful format. The syntax is always something like:

```
df.to_<format>(path, ...)
df = pd.read_<format>(path, ...)
```

`<format>` includes (but is not limited to):
* [read_csv](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) / [to_csv](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html)
* [read_json](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html) / [to_json](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_json.html)
* [read_excel](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html) / [to_excel](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html)
* [read_parquet](https://pandas.pydata.org/docs/reference/api/pandas.read_parquet.html) / [to_parquet](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_parquet.html)
* [read_sql](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html) / [to_sql](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

## Other useful methods

In [44]:
# summary statistics
df.describe()

            col1      col3
count   5.000000  4.000000
mean   -1.670000  2.425000
std     8.508496  4.313641
min   -10.000000 -2.350000
25%   -10.000000 -0.662500
50%    -2.350000  2.975000
75%     7.000000  6.062500
max     7.000000  6.100000

In [45]:
# get dataframe values as numpy array
df.values

array([[-10.0, 'a', -0.1],
       [-2.35, 'b', -2.35],
       [-10.0, 'a', 6.05],
       [7.0, 'c', 6.1],
       [7.0, 'd', nan]], dtype=object)

In [46]:
# remove duplicate rows
df.drop_duplicates(subset=["col1"])

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
3   7.00    c  6.10

In [47]:
# replace null values with given value
df.fillna(0)

    col1 col2  col3
0 -10.00    a -0.10
1  -2.35    b -2.35
2 -10.00    a  6.05
3   7.00    c  6.10
4   7.00    d  0.00

In [48]:
# distinct values with count
s.value_counts()

 7    2
 4    1
 6    1
-1    1
dtype: int64

In [49]:
# renaming columns
df.rename(columns={"col1": "new_name"})

   new_name col2  col3
0    -10.00    a -0.10
1     -2.35    b -2.35
2    -10.00    a  6.05
3      7.00    c  6.10
4      7.00    d   NaN